Repository: stephan1827/shuv_demo
Catalog: Logical/mappView/MainVisu/Resources/Texts/Expressions.tmx
Source language: en
Languages: de

source: Expression
de: Ausdruck

source: Result:
de: Ergebnis:

source: Result used for visibility
de: Ergebnis verwendet für Sichtbarkeit

source: Result used for enable/disable
de: Ergebnis verwendet für Aktiv/Inaktiv

source: An expression is a construct that returns a value (Boolean) after it has been evaluated. An expression is an instance of an expression type whose operands are connected to corresponding sources. An expression type defines operands and their combination.
de: Eine Expression ist ein Konstrukt, das nach seiner Auswertung einen (boolschen) Wert zurückliefert. Die Expression ist Instanz eines Expression-Typs, dessen Operanden an entsprechende Quellen gebunden werden. Ein Expression Typ definiert Operanden und deren Verknüpfungsvorschrift.
